/**
 * Created by cui on 2015/12/16.
 */
define(['config'],function(CONFIG){

    var imgNum = 0;
    //274张图片
    var imgAmount = 274;
    var nameAmount = 334;
    var numArray = [];
    var tempArray = [];
    var imgName = [];
    var count = 1;

    for(var i = 0;i<=imgAmount;i++){
        numArray.push(i);
    }

    return {
        //334个名字
        nameAry : [
            "塔拉斯•利帕","安德烈亚斯•哈根","明麦","艾格妮•伯格","郭紫","维卡特瑞嘉•派达斯克","万斯•沙赫","克莱尔•史密斯",
            "安琳","艾米丽•斯诺","萨蒂•马立克","诺拉•伯格","简金","马力","杰里米•梅森","宏茂","玛雅•佩尔森","彼得•柯兹洛斯基",
            "贾比尔•戈麦斯","英伽•拉斐尔","卡基特•卡罗","萨金娜•迈尔","罗伯特•弗南迪斯","李•哈特曼","谢马克•菲尔莫尔","欧兰德•德勒",
            "彭巴•加西亚","胡尔夫•查韦斯","塞尔达•诺伊曼","艾文•约翰斯顿","麦当娜•库恩","罗兰•阿尔瓦雷斯","迈尔•戈蒂埃","苏莱曼•希门尼斯",
            "萨拉•波克","安东菲娜•杜达","詹妮弗•扎克斯基","沃尔克•布莱克里","莎夏娜•赫夫","罗琳•山尼","基翁•顾达","伟加•迪路加","伊莲娜•朗",
            "羽琉•扎娃","艾伯特•贾米森","安塞尔•克劳斯","纳西尔•格","塔希尔•曼特娜","彼得•林肯","麦娜•里克特","沃伦•大卫","约翰•伯恩斯",
            "艾玛•麦考伊","娜拉•施米特","亚伦•兹欧文斯基","诺蒂加•伟加","萨蒙•奥迪斯","安特斯•佛比斯","关萨卡•希门尼斯","斯待•麦肯齐",
            "凯丝汀•尼古拉斯","伯翰•坎宁安","杰马勒•阿伦","奈玛•马修","嘉尚•麦金塔","赛得里克•曼里尼","科比•科赫","明娜•杜蒙特","塔本•帕特尔",
            "阿蒙•杜邦","齐拉•格劳沃德","梅里尔•富克斯","艾瓦•亚当斯","扎丽娜•迪布瓦","卡尔布•犹思太","德里克•圣地亚哥","布莱恩•彼得森",
            "安东尼克•李","曼哈顿•皮尔斯","奇波•佩尼亚","金•克莱恩","穆哈尔•赫尔曼","蒂娜•艾夫斯","娜菲拉•左凡特","曼弗雷德•欧文","尼克•哈恩",
            "埃伯特•亚瑟","贾米拉赫•伯恩斯","布伦希尔德•阿古拉尔","安玛尔•鲍尔","乌拉•布朗","札赫拉•张","莎士马科•托雷斯","博登•洛迪古斯",
            "吉尔•彭内尔","维多拉•扎贾克","齐克•斯波西多","凯文•哈伯","基思•奥尔森","哈维尔•十明斯基","萨勒瓦•比安奇","贝基•艾森豪",
            "艾莉亚•埃文斯","蝴蝶•布朗克","弗拉德•萨迪","马文•科伦坡","沙里夫•沃尔","塞琳娜•格雷厄姆","美琳娜•科勒","甘地•凯利","哈里斯•亚当斯",
            "汉南•霍奇","拉奇亚•莱曼","纳迪•里奥斯","林恩•贝克","美嘉•库利","依撒尔•埃利斯","佛兰•克斯","巴拉•黄","业萨尔•洛佩斯","朱马•伯格其",
            "戴尔•哈富门","玛蕾妮•布劳恩","卡萨•卡利亚","史塔芬•盖伊","艾德文•陈","凯特•苏达曼","爱丽丝•詹森","森姆•巴克","马塞尔•南曼","伊恩•克莱克",
            "皮特•非利普","凯","凡元尼","伊莱业斯•安德森","一翁","阿纳斯塔西亚•布达","格瑞斯•布朗","杰基•丹尼尔","堂娜•汤普逊","路易斯•比特弗",
            "杰克•赖特","乔纳恩•弗莱施曼","悠纪•吉田","百合","利波•贝恩斯","伟太","里达•伊萨","保罗•马儿","杰西卡•弗朗西斯","瓦伦西亚•杜波丝姬",
            "王晨池","玛丽•欧肯","罗伯特•吉丁","劳拉•琳达","奥斯卡•琼森","茱莉亚•莎夫","沙巴•纳萨尔","利昂•塔菲","奥利弗•阿里","德维达斯•卡兹劳斯卡斯",
            "阿比•哈里斯","艾米•赖安","露比•威尔科特斯","陈娜","伊伦•泰勒","大松","苏菲•克莱恩","尼古拉斯•荷姆","简•珍西斯","萨德瓦•达特","提姆•登科",
            "劳拉•琳达","马克西米利安•斯科","西蒙•罗斯","张波","帕特里克•墨菲","哈米德•帕特尔","海尔温•埃文斯","利奥尼•比尔","凡恩•约斯特","拉扎克•道格",
            "孙舒","李湘","菲利普•林格伦","约书亚•休斯","玛丽•布莱斯","汤姆斯•爱德华","加里•罗伯特","安娜•施密特","遥•铃木","李约克•洛克斯","黄龙",
            "海伦•荷尔","汉娜•齐默曼","雨果•贝伦德","莎拉•洛伦茨","塞巴斯蒂安•汉森","马朱","费拉•诺瓦克","莉娜•耶西","伊德里斯•琼斯","哈卜比•迪比",
            "詹姆斯•威廉姆","安达•曼","艾伯默•康蒂","奥利维亚•杰克森","梁爱丽","莉莉•帕邢","吴兰","勒纳特•罗西","乔克•比拉万","艾玛•奥尔森","阿丽亚•成",
            "宝库","贾米拉•遥","哈里•刘易斯","大鹏","阿尔瓦•欧弗森","丽贝卡•戴维斯","徐梅","卢卡斯•温克勒","瓦迪姆•帕柳卡","亨利克•盖尔巴","克拉拉•科赫",
            "子欣•文特","波林•維佳","萨其•泰勒","杰马里亚•琼斯","罗斯•布朗","卡洛斯•贝利","菲昂•高梅茲","肯迅•里奥斯","巴斯色娃•洛佩兹","布兰卡•佩纳",
            "萨莎•詹宁斯","维多莉亚•泰勒","奥拉迈德•安德森","真子•卡斯蒂罗","弗拉维奥•曼奇尼","卡洛斯•马里诺","琼","帕姆•卡里瓦","奇•瓦特","埃尔温•沃纳",
            "阿蒂萨•史密斯","阿梅瑞戈•贾沃斯基","丝莲娜•金","尼塔•福兹","格温•比安奇","柴斯劳•克拉克","迪莉斯•奥特嘉","达梅德•夏维兹","洗拉•托马斯泽夫斯基",
            "埃克•罗得里格斯","德特雷夫•杨","玛丽•哈奈兹","法比奥•加西亚","米迪尔•费南德兹","戴维•里索","德维恩•拉谷路夫","新陀•克莱恩","安德鲁•赖特",
            "马克•哈恩","秀兰•苏高路斯基","卡米丽•普理查德","卡约德•格里菲斯","埃利尔•普莱斯","罗莫拉•马耶夫斯基","欧文•威尔科克斯","加利亚•奥尔森",
            "多莉•陶瑞斯","恩通比•江","美凤•彼得斯","恩佐•耶格尔","杰克•西兰德","维罗尼卡•莱曼","加斯顿•文森特","迈克尔•杜鲁门","亨利•亚当斯",
            "安南•斯坦格","爱萨莉•瓦格纳","乔治特•李","果若•古普塔","西莱斯特•鲍尔","阿诺拉•外斯","菲利普•佩赫兹","菲比恩•菲尔莫尔","彼得•扎加奇",
            "福密欧•里克特","布里吉达•纽曼","比尔•萨瑟兰郡","雷莱尔•埃斯帕斯托","泰瑞莎•谭","希尔伯特•劳埃德","塞欧波翰•圣地亚哥","布朗•唐",
            "池卡•塔夫脱","阿尔夫•沃格尔","希蒙•波尔克","派琵•施罗德","奥托•布兰德","罗伯特•沃尔","卡斯珀•特纳","欧扎•王","平•齐默曼","晓丹•翰逊",
            "高美里克•施密特","阿尔塔•艾森豪威尔","埃尔皮迪奥•高","奥特里克•迪布瓦","狄龙•柔默","康可巴•克尔","埃尔莎•迈凯","马卡维•吉拉德",
            "弗罗瑞安娜•帕格诺","艾布拉姆•陈","安妮•阿瑟","菲莉茜雅•纳尔逊","莉泽洛特加龙省•雪弗德","苏塞•韦加斯","吉尔•鲍克","基思•马丁",
            "埃斯米•诺维茨基","彻姬塔•戴维森","盖德•哈奇开斯","瑞吉亚•伍德","利维•哈尔平","尼尔•埃利斯","科西莫•菲希尔","方•雷格朗","文燕•杜达",
            "多里•埃瓦莱兹","沃尔夫冈•古滋曼"
        ],
        //生成随机数字
        getRandomNumber : function(startNumber,endNumber){
            var startNumber = startNumber ? startNumber : 0;
            var endNumber = endNumber ? endNumber : 100;
            var numberDiff = parseInt(endNumber - startNumber);
            var randomNumber = 0;
            do{
                randomNumber = Math.floor(Math.random() * numberDiff + startNumber);
            }
            while(!numArray[randomNumber]);
            //防止被重选
            numArray[randomNumber] = null;

            return randomNumber;
        },
        //获取随机名字
        getInputName : function(){
            var randomNumber = 0;
            var name = "";
            do{
                randomNumber = Math.floor(Math.random() * nameAmount + 1);
            }
            while(!this.nameAry[randomNumber]);
            name = this.nameAry[randomNumber];
            this.nameAry[randomNumber] = null;

            return name;
        },
        getImageNum : function(){
            var imgNum = this.getRandomNumber(1,274);
            return imgNum;
        },
        getImageUrl: function(imgNum){
            return CONFIG.imgUrl + "portrait/" + imgNum + ".png";
        },
        getRandomText : function(){
            var imgNum = this.getRandomNumber(1,274);
            return imgNum;
        },
    }
});